#ตัวนำเนินการเปรียบเทียบ
# นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
# ชนิดข้อมูลเหมือนกัน 
#คำตอบ 2 คำตอบ => จริง / เท็จ 

x,y,z = 5,6,9

print("ค่า x มากกว่า y หรือไม่ ? :",x>y)
print("ค่า x น้อยกว่า y หรือไม่ ? :",x<y)
print("ค่า x เท่ากับ y หรือไม่ ? :",x==y)
print("ค่า x ไม่เท่ากับ y หรือไม่ ? :",x!=y)
print("ค่า x มากกว่าหรือเท่ากับ y หรือไม่ ? :",x>=y)
print("ค่า x น้อยกว่าหรือเท่ากับ y หรือไม่ ? :",x<=y)

#และ
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ ? :",x>y>z)
print("ค่า x น้อยกว่า y และ y น้อยกว่า z หรือไม่ ? :",x<y<z)